/*Задача 6.
Дефинирайте променлива „а“, дeфинирайте пойнтер към
нея, присвоете му адреса на променливата. През пойнтера
задайте нова стойност = 5 на променливата „а“. Каква е
стойността на “а”?*/
#include<stdio.h>
int main(void){
    int*p,a;
    a=5;
    printf("Prev value of a:%d\n",a);
    p=&a;
    *p=10;
    printf("The new value of a:%d\n",a);
    return 0;
}