/*Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на екрана.*/
#include<stdio.h>
int main(){
    int a=5;
    int*p=&a;
    printf("The value of a is:%d\n",a);
    *p=a+5;
    printf("The sum of a+5 is:%d\n",*p);
    return 0;
}