/*Задача 10.
Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.*/
#include<stdio.h>
int main(){
    int a;
    int*p;
    printf("The address of a:%p\n",&a);
    p=&a;
    printf("The address of p:%p\n",p);
    printf("The value of a:%d\n",a);
    printf("The value of p:%d\n",*p);
    return 0;
}